Repository: yeager/obd2-viewer
Catalog: po/*.po
Languages: sv

source: Connecting to %s…
sv: Ansluter till %s…

source: Connected to %s
sv: Ansluten till %s

source: Failed to connect to %s
sv: Misslyckades med att ansluta till %s

source: Connection failed
sv: Anslutning misslyckades

source: python-obd is not installed. Install it with: pip install obd
sv: python-obd är inte installerat. Installera det med: pip install obd

source: Missing python-obd
sv: Saknar python-obd

source: Connection error
sv: Anslutningsfel

source: Disconnected
sv: Frånkopplad

source: Connect to Vehicle
sv: Anslut till fordon

source: Saved Profiles
sv: Sparade profiler

source: Connection Settings
sv: Anslutningsinställningar

source: Serial Port
sv: Serieport

source: No ports detected
sv: Inga portar upptäcktes

source: Custom Port Path
sv: Anpassad portsökväg

source: Baud Rate
sv: Baudhastighet

source: Save Profile
sv: Spara profil

source: Connect
sv: Anslut

source: Unknown
sv: Okänt

source: Use
sv: Använd

source: No saved profiles
sv: Inga sparade profiler

source: Speed
sv: Hastighet

source: Coolant Temp
sv: Kylvätsketemperatur

source: Intake Temp
sv: Intagstemperatur

source: Throttle
sv: Gas

source: Engine Load
sv: Motorbelastning

source: Fuel Status
sv: Bränslestatus

source: Refresh rate:
sv: Uppdateringsfrekvens:

source: Read Stored DTCs
sv: Läs lagrade DTC-koder

source: Read Pending DTCs
sv: Läs väntande DTC-koder

source: Clear DTCs
sv: Rensa DTC-koder

source: No DTCs loaded
sv: Inga DTC-koder inlästa

source: Connect to a vehicle and read DTCs
sv: Anslut till ett fordon och läs av DTC-koder

source: Not connected
sv: Inte ansluten

source: Reading stored DTCs…
sv: Läser lagrade DTC-koder...

source: Reading pending DTCs…
sv: Läser väntande DTC-koder...

source: python-obd is not installed
sv: python-obd är inte installerat

source: No DTCs found
sv: Inga DTC-koder hittades

source: No diagnostic trouble codes stored
sv: Inga diagnostiska felkoder lagrade

source: %d DTC(s) found
sv: %d DTC-kod(er) hittades

source: Clear Diagnostic Trouble Codes?
sv: Rensa diagnostiska felkoder?

source: This will reset all stored DTCs and freeze frame data. The check engine light will turn off. This action cannot be undone.
sv: Detta återställer alla lagrade DTC-koder och frysbilddata. Kontrollampan för motorn slocknar. Denna åtgärd kan inte ångras.

source: Cancel
sv: Avbryt

source: Clearing DTCs…
sv: Rensar DTC-koder…

source: DTCs cleared successfully
sv: DTC-koder rensades

source: Export Data
sv: Exportera data

source: Data to Export
sv: Data att exportera

source: Comma-separated values
sv: Kommaseparerade värden

source: Export
sv: Exportera

source: Files
sv: Filer

source: Export from OBD2 Viewer — %s
sv: Exportera från OBD2-visare — %s

source: Read Freeze Frame
sv: Läs frysbild

source: No freeze frame data
sv: Inga frysbildsdata

source: Connect to a vehicle and read freeze frame data from stored DTCs
sv: Anslut till ett fordon och läs frysbildsdata från lagrade DTC-koder

source: Reading freeze frame data…
sv: Läser frysbildsdata...

source: No freeze frame data available
sv: Inga frysbildsdata tillgängliga

source: No DTCs with freeze frame data stored
sv: Inga DTC-koder med frysbildsdata lagrade

source: %d parameters read
sv: %d parametrar lästa

source: No data recorded
sv: Inget data inspelat

source: Start Recording
sv: Starta inspelning

source: Save to CSV
sv: Spara till CSV

source: Clear
sv: Töm

source: Select PIDs to log:
sv: Välj PID:ar att logga:

source: Select at least one PID
sv: Välj minst en PID

source: Stop Recording
sv: Stoppa inspelning

source: Recording…
sv: Spelar in…

source: Stopped — %d samples recorded
sv: Stoppad — %d samplingar inspelade

source: Recording… %d samples (%.0fs)
sv: Spelar in… %d samplingar (%.0fs)

source: CSV Files
sv: CSV-filer

source: Saved to %s
sv: Sparades till %s

source: Time (s)
sv: Tid (s)

source: Log cleared
sv: Logg tömd

source: OBD2 Viewer
sv: OBD2-visare

source: No vehicle connected
sv: Inget fordon anslutet

source: Keyboard Shortcuts
sv: Tangentbordsgenvägar

source: About OBD2 Viewer
sv: Om OBD2-visare

source: Dashboard
sv: Kontrollpanel

source: DTCs
sv: DTC-koder

source: Logger
sv: Loggare

source: Vehicle Info
sv: Fordonsinformation

source: Freeze Frame
sv: Frysbild

source: Ready
sv: Redo

source: Connected
sv: Ansluten

source: Disconnect
sv: Koppla från

source: Error: %s
sv: Fel: %s

source: Translate this app: https://www.transifex.com/danielnylander/obd2-viewer/
sv: Översätt denna app: https://www.transifex.com/danielnylander/obd2-viewer/

source: Refreshing…
sv: Uppdaterar…

source: Welcome
sv: Välkommen

source: Welcome to OBD2 Viewer
sv: Välkommen till OBD2-visare

source: Read vehicle diagnostics via OBD-II. ✓ Read diagnostic trouble codes ✓ Real-time sensor data ✓ Export reports
sv: Läs fordonsdiagnostik via OBD-II. ✓ Läs diagnostiska felkoder ✓ Sensordata i realtid ✓ Exportera rapporter

source: Get Started
sv: Kom igång

source: ECU Name
sv: ECU-namn

source: Calibration ID
sv: Kalibrerings-id

source: Read Vehicle Info
sv: Läs fordonsinformation

source: Vehicle Identification
sv: Fordonsidentifiering

source: OBD Protocol
sv: OBD-protokoll

source: Supported PIDs
sv: PID-koder som stöds

source: Connect and read to see supported PIDs
sv: Anslut och läs för att se vilka PID-koder som stöds

source: Reading vehicle info…
sv: Läser fordonsinfo…

source: %d supported PIDs
sv: %d PID-koder stöds

source: Vehicle info read
sv: Fordonsinformation läst
